/*********************************************************************************************************************
* CYT4BB Opensource Library 即（ CYT4BB 开源库）是一个基于官方 SDK 接口的第三方开源库
* Copyright (c) 2022 SEEKFREE 逐飞科技
*
* 本文件是 CYT4BB 开源库的一部分
*
* CYT4BB 开源库 是免费软件
* 您可以根据自由软件基金会发布的 GPL（GNU General Public License，即 GNU通用公共许可证）的条款
* 即 GPL 的第3版（即 GPL3.0）或（您选择的）任何后来的版本，重新发布和/或修改它
*
* 本开源库的发布是希望它能发挥作用，但并未对其作任何的保证
* 甚至没有隐含的适销性或适合特定用途的保证
* 更多细节请参见 GPL
*
* 您应该在收到本开源库的同时收到一份 GPL 的副本
* 如果没有，请参阅<https://www.gnu.org/licenses/>
*
* 额外注明：
* 本开源库使用 GPL3.0 开源许可证协议 以上许可申明为译文版本
* 许可申明英文版在 libraries/doc 文件夹下的 GPL3_permission_statement.txt 文件中
* 许可证副本在 libraries 文件夹下 即该文件夹下的 LICENSE 文件
* 欢迎各位使用并传播本程序 但修改内容时必须保留逐飞科技的版权声明（即本声明）
*
* 文件名称          zf_device_pmw3901
* 公司名称          成都逐飞科技有限公司
* 版本信息          查看 libraries/doc 文件夹内 version 文件 版本说明
* 开发环境          IAR 9.40.1
* 适用平台          CYT4BB
* 店铺链接          https://seekfree.taobao.com/
*
* 修改记录
* 日期              作者                备注
* 2026-03-09       pudding           first version
********************************************************************************************************************/
/*********************************************************************************************************************
* 接线定义：
*                   ------------------------------------
*                   模块管脚            单片机管脚
*                   SCLK               查看 zf_device_pmw3901.h 中 PMW3901_SCLK_PIN 宏定义
*                   MOSI               查看 zf_device_pmw3901.h 中 PMW3901_MOSI_PIN 宏定义
*                   MISO               查看 zf_device_pmw3901.h 中 PMW3901_MISO_PIN 宏定义
*                   NCS                查看 zf_device_pmw3901.h 中 PMW3901_CS_PIN 宏定义
*                   VCC                5V电源
*                   GND                电源地
*                   ------------------------------------
********************************************************************************************************************/
#ifndef _ZF_DEVICE_PMW3901_H_
#define _ZF_DEVICE_PMW3901_H_

#include "zf_common_typedef.h"

//====================================================硬件 SPI 驱动====================================================
#define PMW3901_SPI_SPEED            (2 * 1000 * 1000 )                         // 硬件 SPI 速率
#define PMW3901_SPI                  (SPI_0           )                         // 硬件 SPI 号
#define PMW3901_SCLK_PIN             (SPI0_CLK_P02_2  )                         // 硬件 SPI SCK 引脚
#define PMW3901_MOSI_PIN             (SPI0_MOSI_P02_1 )                         // 硬件 SPI MOSI 引脚
#define PMW3901_MISO_PIN             (SPI0_MISO_P02_0 )                         // 硬件 SPI MISO 引脚
#define PMW3901_CS_PIN               (P02_3)                                    // CS 片选引脚
#define PMW3901_CS(x)                ((x) ? (gpio_high(PMW3901_CS_PIN)) : (gpio_low(PMW3901_CS_PIN)))
//====================================================硬件 SPI 驱动====================================================



//================================================定义 PMW3901 内部地址================================================
#define PMW3901_PRODUCT_ID           (0x00)
#define PMW3901_REVISION_ID          (0x01)
#define PMW3901_MOTION               (0x02)
#define PMW3901_DELTA_X_L            (0x03)
#define PMW3901_DELTA_X_H            (0x04)
#define PMW3901_DELTA_Y_L            (0x05)
#define PMW3901_DELTA_Y_H            (0x06)
#define PMW3901_MOTION_BURST         (0x16)
#define PMW3901_POWER_UP_RESET       (0x3A)
#define PMW3901_SHUTDOWN             (0x3B)
#define PMW3901_OBSERVATION          (0x15)
//================================================定义 PMW3901 内部地址================================================



//================================================声明 PMW3901 全局变量================================================
extern int16 pmw3901_delta_x  , pmw3901_delta_y  ;                              // 偏移速度数据变量
extern int32 pmw3901_delta_x_i, pmw3901_delta_y_i;                              // 偏移距离数据变量
//================================================声明 PMW3901 全局变量================================================



//================================================声明 PMW3901 基础函数================================================

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     初始化 PMW3901
// 参数说明     void
// 返回参数     uint8           1-失败 0-成功
// 使用示例     pmw3901_init();     
// 备注信息         
//-------------------------------------------------------------------------------------------------------------------
uint8 pmw3901_init              (void);

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     获取 PMW3901 运动数据
// 参数说明     void
// 返回参数     void
// 使用示例     pmw3901_get_motion();
// 备注信息     执行后直接查看 pmw3901_delta_x 和 pmw3901_delta_y  
//              请务必注意以下使用事项：
//              1.该函数调用周期至少 20 毫秒
//              2.测量距离至少大于 5 厘米
//              3.务必保持光线充足 否则无法正常采集到光流数据
//-------------------------------------------------------------------------------------------------------------------
void  pmw3901_get_motion        (void);

//================================================声明 PMW3901 基础函数================================================

#endif
